In [11]:
#Dependencies
import pandas as pd

In [12]:
#store filepath in a variable
Profit_loss = "data.csv"

In [13]:
#Reads the Data file with the pandas library
#not every CSV file requires an encoding. 
file_one_df = pd.read_csv(Profit_loss)

In [14]:
#shows just the header or in this case the first 7. 
file_one_df.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

In [15]:
#The total number of months included in the dataset
Total_Months = file_one_df['Date'].count()
print (Total_Months)

86

In [16]:
#The net total amount of "profit/losses" over the entire period
Total_profit_loss = file_one_df[['Profit/Losses']].sum()
Total_raw = Total_profit_loss['Profit/Losses']
Total_raw
Total = '${:,.0f}'.format(Total_raw)
Total

'$38,382,578'

In [17]:
file_one_df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [18]:
file_one_df['delta'] = file_one_df["Profit/Losses"].diff()

In [19]:
file_one_df

        Date  Profit/Losses     delta
0   Jan-2010         867884       NaN
1   Feb-2010         984655  116771.0
2   Mar-2010         322013 -662642.0
3   Apr-2010         -69417 -391430.0
4   May-2010         310503  379920.0
..       ...            ...       ...
81  Oct-2016         102685 -665765.0
82  Nov-2016         795914  693229.0
83  Dec-2016          60988 -734926.0
84  Jan-2017         138230   77242.0
85  Feb-2017         671099  532869.0

[86 rows x 3 columns]

In [20]:
#average Change
Average_change_ = file_one_df[['delta']].mean()
Average_change = Average_change_['delta']
change = '(${:,.2f})'.format(Average_change)
change

'($-2,315.12)'

In [21]:
#greatest Increase in profits
Greatest_increase_ = file_one_df[['delta']].max()
Greatest_increase = Greatest_increase_['delta']
increase = '${:,.0f}'.format(Greatest_increase)
increase

'$1,926,159'

In [22]:
Greatest_decrease_ = file_one_df[['delta']].min()
Greatest_decrease = Greatest_decrease_['delta']
decrease = '(${:,.0f})'.format(Greatest_decrease)
decrease

'($-2,196,167)'

In [51]:
print(f'Total Months:      {Total_Months}')
print(f'Total:             {Total}')
print(f'Average Change:    {change}')
print(f'Greatest Increase: {increase}')
print(f'Greatest Decrease: {decrease}')

Total Months:      86
Total:             $38,382,578
Average Change:    ($-2,315.12)
Greatest Increase: $1,926,159
Greatest Decrease: ($-2,196,167)

In [53]:
f = open("budgetsummary.txt", "w")
f.write(f'Total Months:      {Total_Months}')
f.write(f'\nTotal:             {Total}')
f.write(f'\nAverage Change:    {change}')
f.write(f'\nGreatest Increase: {increase}')
f.write(f'\nGreatest Decrease: {decrease}')
f.close()